print ("Hello World")
#функция Print нужна для вывода данных в окно консоли
name = input("Скажи сколько будет ")
#переменная, которая хранит в себе строку
age = int(input("Введите свой ответ"))
#Переменная, которая хранит в себе целое число
form = 4
#Переменная, которая хранит в себе дробь
print(type(age), type(name))
'''
функция Tupe - нужна для определения 
типа данных наших переменных
'''
print ("Hello,", name, ' твой ответ', age,'')
print("правильный ответ ", form)
#print('ваш ответ:',int(input('сколько будет 5*8/10?')),"Правильный ответ 4" интересная строчка кода
#Задание 1
#Пользователь вводит с клавы 3 числа. Необходимо найти сумму чисел,
#Найти произведение чисел, найти разность чисел, найти деление чисел.
#Результат вычеслений операции вывести на экран.
