#напишим прогу, которая переводит из 10 СС в другую СС
# 1 Zadanie

# num_1 = int(input("Введите число: "))
#
# if  num_1 % 13 == 0:
#     print(f"Число {num_1} делится на 13")
# else:
#     print(f"Число {num_1} не делиться на 13")

# 2 Задание
# num_1 = int(input("Введите число: "))
# print(num_1 % 10)
# num_1 = num_1 // 10
# print(num_1 % 10)
# num_1 = num_1 // 10
# print(num_1 % 10)
# num_1 = num_1 // 10
# 3 Задание

e = int(input("Введите возраст: "))
if e >= 18: print("проходим")

elif:
    ("не проходим")


